# 作業 : (Kaggle)鐵達尼生存預測
https://www.kaggle.com/c/titanic

In [1]:
import warnings
warnings.filterwarnings('ignore')

# 作業1
* 請仿照範例，將鐵達尼範例中的類別型特徵改用均值編碼實作一次

In [2]:
# 做完特徵工程前的所有準備 (與前範例相同)
import pandas as pd
import numpy as np
import copy, time
from sklearn.preprocessing import MinMaxScaler
from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LogisticRegression
from sklearn.preprocessing import LabelEncoder

data_path = '../data/titanic/'
df_train = pd.read_csv(data_path + 'titanic_train.csv')
df_test = pd.read_csv(data_path + 'titanic_test.csv')

train_Y = df_train['Survived']
ids = df_test['PassengerId']
df_train = df_train.drop(['PassengerId', 'Survived'] , axis=1)
df_test = df_test.drop(['PassengerId'] , axis=1)
df = pd.concat([df_train,df_test])
df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
#只取類別值 (object) 型欄位, 存於 object_features 中
object_features = []
for dtype, feature in zip(df.dtypes, df.columns):
    if dtype == 'object':
        object_features.append(feature)
print(f'{len(object_features)} Numeric Features : {object_features}\n')

# 只留類別型欄位
df = df[object_features]
df = df.fillna('None')
train_num = train_Y.shape[0]
df.head()

5 Numeric Features : ['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,None,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,None,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,None,S

# 作業2
* 觀察鐵達尼生存預測中，均值編碼與標籤編碼兩者比較，哪一個效果比較好? 可能的原因是什麼?
> 均值編碼效果比較好。<br>
> 因均值編碼本就是依⽬標值均值作為特徵編碼依據，若編碼欄位與⽬標值有明顯關聯，此種編碼方式應比其他方式更能表達出可能之關聯性

In [4]:
result = dict()

In [18]:
# 對照組 : 標籤編碼 + 邏輯斯迴歸
df_temp = pd.DataFrame()
for c in df.columns:
    df_temp[c] = LabelEncoder().fit_transform(df[c])
train_X = df_temp[:train_num]
estimator = LogisticRegression()
start = time.time()

score = cross_val_score(estimator, train_X, train_Y, cv=5).mean()
spent_time = time.time() - start

print(f'shape : {train_X.shape}')
print(f'score : {score}')
print(f'time : {spent_time} sec')

result['Label+Logistic'] = (score, spent_time)

shape : (891, 5)
score : 0.780004837244799
time : 0.03900146484375 sec

In [22]:
# 均值編碼 + 邏輯斯迴歸
data = pd.concat([df[:train_num], train_Y], axis=1)
for c in df.columns:
    mean_df = data.groupby([c])['Survived'].mean().reset_index()
    mean_df.columns = [c, f'{c}_mean']
    data = pd.merge(data, mean_df, on=c, how='left')
    data = data.drop([c] , axis=1)
data = data.drop(['Survived'] , axis=1)
train_X = data
#estimator = LogisticRegression(solver='lbfgs')
estimator = LogisticRegression()
start = time.time()

score = cross_val_score(estimator, train_X, train_Y, cv=5).mean()
spent_time = time.time() - start

print(f'shape : {train_X.shape}')
print(f'score : {score}')
print(f'time : {spent_time} sec')

result['Mean+Logistic'] = (score, spent_time)

shape : (891, 5)
score : 1.0
time : 0.027002811431884766 sec

In [23]:
from IPython.display import Markdown

params = [
    result['Label+Logistic'],
    result['Mean+Logistic'],
]

html = """\
<table align="left">
    <tr>
        <td>(鐵達尼號)</td>  <td>羅吉斯迴歸</td>
    </tr>
    <tr>
        <td>標籤編碼<br>Label Encoding</td>
        <td>{params[0][0]:.5f} ({params[0][1]:.3f} secs)</td>
    </tr>
    <tr>
        <td>均值編碼<br>Mean Encoding</td>
        <td>{params[1][0]:.5f} ({params[1][1]:.3f} secs)</td>
    </tr>
</table>
""".format(params=params)

Markdown(html)

<table align="left">
    <tr>
        <td>(鐵達尼號)</td>  <td>羅吉斯迴歸</td>
    </tr>
    <tr>
        <td>標籤編碼<br>Label Encoding</td>
        <td>0.78000 (0.039 secs)</td>
    </tr>
    <tr>
        <td>均值編碼<br>Mean Encoding</td>
        <td>1.00000 (0.027 secs)</td>
    </tr>
</table>